#===================================================================================================================
#                                                 BIBLIOTECAS
#===================================================================================================================

from colorama import init, Fore, Style                   #colorir terminal 
init(autoreset=True)                                     #inicializa o colorama e evita que ele continue após o print

import mysql.connector                                  #banco de dados
import datetime
import time
import os
import random

#===================================================================================================================
#                                                 FUNÇOES
#===================================================================================================================

# ============ PRINTS DE MENSAGENS POR TIPO/COR (SUCESSO, ERRO E ALERTA) ================

def sucesso (texto):
    print(Style.BRIGHT + Fore.GREEN + "✅ SUCESSO:  " + texto)

def erro (texto):
    print(Style.BRIGHT + Fore.RED + "❌ ERRO:  " + texto)

def alerta (texto):
    print(Style.BRIGHT + Fore.YELLOW + "⚠️  ALERTA:  " + texto)

# =================== LOG DE OCORRENCIAS (ESCRITA EM ARQUIVO TXT) =======================

data_hora = datetime.datetime.now().strftime("[%y-%m-%d %H:%M:%S]")
print(data_hora)

def log_zerezima():
    with open("ocorrencias.txt", "a", encoding="utf-8") as arq:                          #se nao existe, ele já cria o arquivo
        arq.write("\nABERTURA: Votação iniciada com sucesso. Total de votos zerado.")                                           #write precisa de um parametro de escrita
         

#===================================================================================================================
#                                          CONEXAO COM BANCO DE DADOS
#===================================================================================================================

conexao = mysql.connector.connect (
    host = "localhost",
    port = 3306,
    user = "root",
    password = "1234",
    database = "bd_ladpy"
)

if conexao.is_connected():
    sucesso("Banco conectado com sucesso!")

#===================================================================================================================
#                                                BANNERS/TITULOS ESTILIZADOS
#===================================================================================================================

banner_inicio = f"""
{Fore.CYAN}{Style.BRIGHT}
██╗      █████╗ ██████╗    ██████╗ ██╗   ██╗
██║     ██╔══██╗██╔══██╗   ██╔══██╗╚██╗ ██╔╝
██║     ███████║██║  ██║   ██████╔╝ ╚████╔╝ 
██║     ██╔══██║██║  ██║   ██╔═══╝   ╚██╔╝  
███████╗██║  ██║██████╔╝██╗██║        ██║   
╚══════╝╚═╝  ╚═╝╚═════╝ ╚═╝╚═╝        ╚═╝   
{Fore.GREEN}{Style.BRIGHT}
 █▓▒▒░░░ SISTEMA DE VOTAÇÃO DIGITAL ░░░▒▒▓█
"""

banner_gerenciamento = f"""
{Fore.CYAN}{Style.BRIGHT}
█▀▀ █▀▀ █▀█ █▀▀ █▄░█ █▀▀ █ ▄▀█ █▀▄▀█ █▀▀ █▄░█ ▀█▀ █▀█
█▄█ ██▄ █▀▄ ██▄ █░▀█ █▄▄ █ █▀█ █░▀░█ ██▄ █░▀█ ░█░ █▄█
"""

banner_votacao = f"""
{Fore.CYAN}{Style.BRIGHT}
█░█ █▀█ ▀█▀ ▄▀█ █▀▀ ▄▀█ █▀█
▀▄▀ █▄█ ░█░ █▀█ █▄▄ █▀█ █▄█
"""

#===================================================================================================================
#                                                INICIO DO CODIGO
#===================================================================================================================


